owhinata/stm32f746g-disco/port/camera/camera.c
static volatile int      cam_stream_active;  /* streaming mode gate             */
static volatile int      cam_stop_req;       /* stop requested (producer drains)*/
static volatile int      cam_stream_err;     /* DCMI OVR -> terminal stop       */
static volatile uint32_t cam_stream_ovr;     /* DCMI overrun count              */
static volatile uint32_t cam_ring_ovr;       /* free-slot exhaustion / lost     */
static volatile uint32_t cam_stream_fe;      /* DMA FIFO/DME errors tolerated (#56) */
static uint32_t cam_start_tick;              /* HAL tick at start (--secs)       */
static uint32_t cam_target_frames;           /* 0 = unbounded                   */
static uint32_t cam_target_secs;             /* 0 = unbounded                   */
static uint32_t cam_last_ct;                 /* CT at last serviced completion  */
static struct frame_desc *cam_m0, *cam_m1;   /* slots currently in M0AR/M1AR    */

/* ---- locking ------------------------------------------------------------ */
/* Public API entries take the mutex here; all real work below lives in
   *_locked() helpers so no path ever re-acquires cam_lock (a capture in #41
   probes on demand by calling the _locked helper directly). */

static int op_lock(void)
{
	if (!cam_ready)
		return CAM_ERR_STATE;
	if (tx_mutex_get(&cam_lock, TX_WAIT_FOREVER) != TX_SUCCESS)
		return CAM_ERR_STATE;
	return 0;
}

static void op_unlock(void)
{
	tx_mutex_put(&cam_lock);
}

/* ---- OV5640 bus glue (OV5640_IO_t) --------------------------------------- */

/* OV5640_ReadID() calls IO.Init() unconditionally, so a real (if empty)
   function is mandatory; the peripheral is already up from camera_init(). */
static int32_t cam_io_init(void)
{
	return OV5640_OK;
}

static int32_t cam_io_deinit(void)
{
	return OV5640_OK;
}

static int32_t cam_io_gettick(void)
{
	return (int32_t)HAL_GetTick();
}

static int32_t cam_io_write(uint16_t addr, uint16_t reg, uint8_t *data,
                            uint16_t len)
{
	if (HAL_I2C_Mem_Write(&hcam_i2c, addr, reg, I2C_MEMADD_SIZE_16BIT,
	                      data, len, CAM_I2C_TIMEOUT_MS) != HAL_OK)
		return OV5640_ERROR;
	return OV5640_OK;
}

static int32_t cam_io_read(uint16_t addr, uint16_t reg, uint8_t *data,
                           uint16_t len)
{
	if (HAL_I2C_Mem_Read(&hcam_i2c, addr, reg, I2C_MEMADD_SIZE_16BIT,
	                     data, len, CAM_I2C_TIMEOUT_MS) != HAL_OK)
		return OV5640_ERROR;
	return OV5640_OK;
}

/* ---- power + probe (locked helpers) -------------------------------------- */

static void power_off_locked(void)
{
	HAL_GPIO_WritePin(CAM_PWR_PORT, CAM_PWR_PIN, GPIO_PIN_SET);
	info.chip_id     = 0;
	info.powered     = 0;
	info.configured  = 0;
	info.frame_valid = 0;
	cam_colorbar     = -1;
}

/* PH13 high 100 ms -> low, then settle: the H747I BSP HwReset timing for the
   same module family.  Always a full cycle so a re-probe recovers a wedged
   sensor (there is no GPIO reset line -- DCMI_NRST is on the board NRST net). */
static void power_cycle_locked(void)
{
	HAL_GPIO_WritePin(CAM_PWR_PORT, CAM_PWR_PIN, GPIO_PIN_SET);
	tx_thread_sleep(100);
	HAL_GPIO_WritePin(CAM_PWR_PORT, CAM_PWR_PIN, GPIO_PIN_RESET);
	tx_thread_sleep(20);
}

static int camera_probe_locked(uint32_t *chip_id)
{
	uint32_t id = 0;

	power_cycle_locked();
	info.configured  = 0;
	info.frame_valid = 0;
	cam_colorbar     = -1;   /* power cycle reset the sensor registers */

	/* OV5640_ReadID software-resets the sensor and waits 500 ms (GetTick
	   poll) before reading 0x300A/0x300B. */
	if (OV5640_ReadID(&ov5640, &id) != OV5640_OK) {
		power_off_locked();
		LOG_WRN("no I2C response at 0x%02x (module connected?)",
		        CAM_I2C_ADDR);
		return CAM_ERR_NO_SENSOR;
	}
	if (id != OV5640_ID) {
		power_off_locked();
		LOG_ERR("unexpected chip ID 0x%04lx (want 0x%04x)",
		        (unsigned long)id, OV5640_ID);
		return CAM_ERR_NO_SENSOR;
	}

	info.chip_id = id;
	info.powered = 1;
	if (chip_id != NULL)
		*chip_id = id;
	LOG_INF("OV5640 up: chip ID 0x%04lx", (unsigned long)id);
	return 0;
}

/* ---- quality settings (locked helpers, issue #44) ------------------------ */

/* Map the port-neutral enums to the lib/ov5640 constants. */
static uint32_t awb_to_ov(uint8_t a)
{
	switch (a) {
	case CAM_AWB_SUNNY:  return OV5640_LIGHT_SUNNY;
	case CAM_AWB_OFFICE: return OV5640_LIGHT_OFFICE;
	case CAM_AWB_HOME:   return OV5640_LIGHT_HOME;
	case CAM_AWB_CLOUDY: return OV5640_LIGHT_CLOUDY;
	default:             return OV5640_LIGHT_AUTO;
	}
}

static uint32_t effect_to_ov(uint8_t e)
{
	switch (e) {
	case CAM_FX_BW:       return OV5640_COLOR_EFFECT_BW;
	case CAM_FX_SEPIA:    return OV5640_COLOR_EFFECT_SEPIA;
	case CAM_FX_NEGATIVE: return OV5640_COLOR_EFFECT_NEGATIVE;
	case CAM_FX_BLUE:     return OV5640_COLOR_EFFECT_BLUE;
	case CAM_FX_RED:      return OV5640_COLOR_EFFECT_RED;
	case CAM_FX_GREEN:    return OV5640_COLOR_EFFECT_GREEN;
	default:              return OV5640_COLOR_EFFECT_NONE;
	}
}

static uint32_t flip_to_ov(uint8_t f)
{
	switch (f) {
	case CAM_FLIP_MIRROR: return OV5640_MIRROR;
	case CAM_FLIP_FLIP:   return OV5640_FLIP;
	case CAM_FLIP_BOTH:   return OV5640_MIRROR_FLIP;
	default:              return OV5640_MIRROR_FLIP_NONE;
	}
}

static uint32_t zoom_to_ov(uint8_t z)
{
	switch (z) {
	case 2:  return OV5640_ZOOM_x2;
	case 4:  return OV5640_ZOOM_x4;
	case 8:  return OV5640_ZOOM_x8;
	default: return OV5640_ZOOM_x1;
	}
}

/* A tinting effect (bw/sepia/blue/red/green) fixes the U/V channels via
   SDE_CTRL3/4; saturation and hue write those same registers, so they fight.
   Negative and "none" leave U/V alone, so saturation/hue coexist with them. */
static int effect_is_tint(uint8_t e)
{
	return e == CAM_FX_BW || e == CAM_FX_SEPIA || e == CAM_FX_BLUE ||
	       e == CAM_FX_RED || e == CAM_FX_GREEN;
}

/*
 * Push the whole cached settings block to a powered+configured sensor and fix
 * up SDE_CTRL0 so the SDE controls coexist.  Applied in a fixed order so the
 * shared SDE_CTRL8 sign/enable bits (touched via the ST setters' read-modify-
 * writes) settle deterministically; SDE_CTRL0 is then rewritten as the OR of
 * every active function's enable bit (the ST setters each leave only their own).
 * Caller holds cam_lock and has info.configured == 1.
 */
static int settings_apply_all_locked(void)
{
	/* Mirrors lib/ov5640 hue_degree_ctrl8[] (OV5640 hue sin/cos sign bits,
	   masked to SDE8_HUE_SIGNS); indexed by settings.hue - CAM_HUE_MIN. */
	static const uint8_t hue_sign[CAM_HUE_MAX - CAM_HUE_MIN + 1] = {
		0x32u, 0x32u, 0x32u, 0x02u, 0x02u, 0x02u,
		0x01u, 0x01u, 0x01u, 0x31u, 0x31u, 0x31u
	};
	int tint = effect_is_tint(settings.effect);
	uint8_t sde0, sde8, want = 0, want8;

	if (OV5640_SetLightMode(&ov5640, awb_to_ov(settings.awb)) != OV5640_OK)
		goto io_err;
	if (OV5640_SetColorEffect(&ov5640, effect_to_ov(settings.effect))
	    != OV5640_OK)
		goto io_err;
	if (OV5640_SetBrightness(&ov5640, settings.brightness) != OV5640_OK)
		goto io_err;
	if (OV5640_SetContrast(&ov5640, settings.contrast) != OV5640_OK)
		goto io_err;
	if (!tint) {
		if (OV5640_SetSaturation(&ov5640, settings.saturation) != OV5640_OK)
			goto io_err;
		if (OV5640_SetHueDegree(&ov5640, settings.hue) != OV5640_OK)
			goto io_err;
	}

	/* SDE_CTRL8 fixup: the OR-only setters above cannot clear their shared
	   sign bits, so rewrite the managed bits with the exact value the cache
	   implies (see OV5640_REG_SDE_CTRL8 comment). */
	want8 = SDE8_UV_MANUAL;
	if (settings.brightness < 0)
		want8 |= SDE8_YBRIGHT_SIGN;
	if (!tint)
		want8 |= (uint8_t)(hue_sign[settings.hue - CAM_HUE_MIN] &
		                   SDE8_HUE_SIGNS);
	if (cam_io_read(CAM_I2C_ADDR, OV5640_REG_SDE_CTRL8, &sde8, 1) != OV5640_OK)
		goto io_err;
	sde8 = (uint8_t)((sde8 & (uint8_t)~SDE8_MANAGED) | want8);
	if (cam_io_write(CAM_I2C_ADDR, OV5640_REG_SDE_CTRL8, &sde8, 1) != OV5640_OK)
		goto io_err;

	/* SDE_CTRL0 fixup -- combine the enable bits the setters above each wiped. */
	if (settings.effect == CAM_FX_NEGATIVE)
		want |= SDE0_NEG_EN;
	else if (tint)
		want |= SDE0_TINT;
	want |= SDE0_CONTRAST_EN;             /* brightness + contrast (Y path) */
	if (!tint)
		want |= SDE0_SAT_EN | SDE0_HUE_EN;

	if (cam_io_read(CAM_I2C_ADDR, OV5640_REG_SDE_CTRL0, &sde0, 1) != OV5640_OK)
		goto io_err;
	sde0 = (uint8_t)((sde0 & (uint8_t)~SDE0_MANAGED) | want);
	if (cam_io_write(CAM_I2C_ADDR, OV5640_REG_SDE_CTRL0, &sde0, 1) != OV5640_OK)
		goto io_err;

	/* Geometry / exposure controls are independent of the SDE block. */
	if (OV5640_MirrorFlipConfig(&ov5640, flip_to_ov(settings.flip)) != OV5640_OK)
		goto io_err;
	if (OV5640_ZoomConfig(&ov5640, zoom_to_ov(settings.zoom)) != OV5640_OK)
		goto io_err;
	if (OV5640_NightModeConfig(&ov5640,
	        settings.night ? NIGHT_MODE_ENABLE : NIGHT_MODE_DISABLE)
	    != OV5640_OK)
		goto io_err;

	settings_dirty = 0;
	return 0;
io_err:
	LOG_ERR("OV5640 settings apply failed (I2C)");
	return CAM_ERR_HAL;
}

/* Apply now if the sensor is live; otherwise the cache is enough.  Cache-only
   when not configured (the next capture's lazy configure re-applies it after
   OV5640_Init wipes the SDE block) or while the colorbar test pattern is up
   (returning to live re-applies, and we must not disturb its SDE_CTRL4). */
static int apply_if_live_locked(void)
{
	if (!info.configured || cam_colorbar != 0)
		return 0;
	return settings_apply_all_locked();
}

/* ---- capture (locked helpers, issue #41) ---------------------------------- */

/* Remove any leftover signals so a stale post cannot satisfy the next wait. */
static void drain_done(void)
{
	while (tx_semaphore_get(&cam_done, TX_NO_WAIT) == TX_SUCCESS)
		;
}

/* Program the sensor for QVGA RGB565 (once after each power-up) and select
   the live / colorbar source.  Both paths sleep so AEC/AWB or the pattern
   switch settles before the snapshot. */
static int camera_configure_locked(int colorbar)
{
	if (!info.configured) {
		if (OV5640_Init(&ov5640, OV5640_R320x240, OV5640_RGB565)
		    != OV5640_OK) {
			LOG_ERR("OV5640_Init failed");
			return CAM_ERR_HAL;
		}
		info.configured = 1;
		cam_colorbar    = -1;   /* forces the mode block below to run */
		tx_thread_sleep(CAM_SETTLE_INIT_MS);
	}

	if (cam_colorbar != colorbar) {
		if (OV5640_ColorbarModeConfig(&ov5640,
		                              colorbar ? COLORBAR_MODE_ENABLE
		                                       : COLORBAR_MODE_DISABLE)
		    != OV5640_OK) {
			LOG_ERR("OV5640 colorbar config failed");
			return CAM_ERR_HAL;
		}
		tx_thread_sleep(CAM_SETTLE_MODE_MS);

