owhinata/stm32f746g-disco/port/camera/camera.c
		/* Re-apply the cached quality settings LAST, in live mode only:
		   OV5640_Init and ColorbarModeConfig(DISABLE) both write the SDE
		   register block (the latter sets SDE_CTRL4), so the settings must
		   land after them or they get clobbered (issue #44).  The colorbar
		   test pattern owns its own SDE_CTRL4 and ignores quality, so skip
		   it there.  cam_colorbar is committed only after a successful apply
		   so a failed apply re-runs this block on the next capture. */
		if (!colorbar) {
			int rc = settings_apply_all_locked();

			if (rc != 0)
				return rc;
		}
		cam_colorbar = colorbar;
	}

	/* Mode unchanged but a prior live apply failed (settings_dirty): retry so
	   the sensor matches the cache.  Skipped in colorbar mode -- quality is
	   irrelevant there and would disturb the test pattern's SDE_CTRL4. */
	if (!colorbar && settings_dirty) {
		int rc = settings_apply_all_locked();

		if (rc != 0)
			return rc;
	}
	return 0;
}

static int camera_capture_locked(int colorbar)
{
	int rc;

	if (!sdram_is_up())
		return CAM_ERR_STATE;

	if (cam_stream_active)
		return CAM_ERR_STATE;   /* streaming owns the DCMI/DMA (issue #46) */

	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}

	rc = camera_configure_locked(colorbar);
	if (rc != 0)
		return rc;

	info.frame_valid = 0;
	drain_done();
	cam_xfer_err    = 0;
	cam_xfer_active = 1;

	/* Re-arm the error interrupts: HAL_DCMI_Init enabled LINE/VSYNC/ERR/OVR
	   once, but the snapshot FRAME ISR disables them all
	   (stm32f7xx_hal_dcmi.c FRAME handling), and HAL_DCMI_Start_DMA does not
	   re-enable them -- without this, an overrun/sync error on the second and
	   later captures would surface as a timeout instead of CAM_ERR_HAL.
	   LINE/VSYNC stay off (nothing consumes them; they fire per line/frame).
	   Clear stale flags first so an old latched error cannot trip the ISR
	   the moment the interrupt enables. */
	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR);

	/* Single transfer: 38400 words <= 65535 NDTR, no double buffering.  No
	   cache maintenance -- cam_frame is in the MPU non-cacheable SDRAM. */
	if (HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)cam_frame,
	                       CAMERA_FRAME_BYTES / 4u) != HAL_OK) {
		cam_xfer_active = 0;
		(void)HAL_DCMI_Stop(&hdcmi);
		drain_done();
		LOG_ERR("DCMI start failed (err 0x%lx)",
		        (unsigned long)HAL_DCMI_GetError(&hdcmi));
		return CAM_ERR_HAL;
	}

	if (tx_semaphore_get(&cam_done, CAM_XFER_TIMEOUT_TICKS) != TX_SUCCESS) {
		cam_xfer_active = 0;
		(void)HAL_DCMI_Stop(&hdcmi);
		drain_done();
		LOG_ERR("frame timed out (no DCMI sync? check wiring)");
		return CAM_ERR_TIMEOUT;
	}
	cam_xfer_active = 0;

	if (cam_xfer_err) {
		(void)HAL_DCMI_Stop(&hdcmi);
		drain_done();
		LOG_ERR("capture error (HAL err 0x%lx)",
		        (unsigned long)HAL_DCMI_GetError(&hdcmi));
		return CAM_ERR_HAL;
	}

	/* Snapshot auto-cleared CAPTURE; Stop also disables the DCMI and leaves
	   the HAL in a clean READY state for the next capture. */
	(void)HAL_DCMI_Stop(&hdcmi);
	cam_frame_gen++;        /* new pixels: multi-call readers must notice */
	info.frame_valid = 1;
	return 0;
}

/* ---- public API ----------------------------------------------------------- */

int camera_capture(int colorbar)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	rc = camera_capture_locked(colorbar != 0);
	op_unlock();
	return rc;
}

int camera_frame_read(uint32_t offset, void *dst, uint32_t len,
                      uint32_t *gen)
{
	int rc;

	if (dst == NULL || len == 0u)
		return CAM_ERR_PARAM;
	/* Subtraction form: offset + len cannot wrap. */
	if (offset >= CAMERA_FRAME_BYTES || len > CAMERA_FRAME_BYTES - offset)
		return CAM_ERR_PARAM;

	rc = op_lock();
	if (rc != 0)
		return rc;
	if (!info.frame_valid) {
		op_unlock();
		return CAM_ERR_NO_FRAME;
	}
	memcpy(dst, (const uint8_t *)cam_frame + offset, len);
	if (gen != NULL)
		*gen = cam_frame_gen;
	op_unlock();
	return 0;
}

void camera_frame_invalidate(void)
{
	if (op_lock() != 0)
		return;
	info.frame_valid = 0;
	op_unlock();
}

int camera_streaming(void)
{
	return cam_stream_active;   /* volatile; a destructive .sdram op must refuse */
}

int camera_probe(uint32_t *chip_id)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* streaming owns the sensor/DCMI (#46) */
		op_unlock();
		return CAM_ERR_STATE;
	}
	rc = camera_probe_locked(chip_id);
	op_unlock();
	return rc;
}

int camera_power_off(void)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* cutting power mid-stream wrecks the HW */
		op_unlock();
		return CAM_ERR_STATE;
	}
	power_off_locked();
	op_unlock();
	return 0;
}

int camera_get_info(struct camera_info *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = info;
	op_unlock();
	return 0;
}

/* ---- quality settings public API (issue #44) ----------------------------- */

int camera_get_settings(struct camera_settings *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = settings;
	op_unlock();
	return 0;
}

/* Shared tail for every level setter: takes the mutex, stashes the validated
   value (already range-checked) and re-applies if the sensor is live.
   @field points into `settings`. */
static int set_level(int8_t *field, int value)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	*field = (int8_t)value;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_brightness(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.brightness, level);
}

int camera_set_contrast(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.contrast, level);
}

int camera_set_saturation(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.saturation, level);
}

int camera_set_hue(int degrees)
{
	if (degrees < CAM_HUE_MIN * 30 || degrees > CAM_HUE_MAX * 30 ||
	    (degrees % 30) != 0)
		return CAM_ERR_PARAM;
	return set_level(&settings.hue, degrees / 30);
}

int camera_set_awb(enum camera_awb mode)
{
	int rc;

	if ((unsigned)mode > CAM_AWB_CLOUDY)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.awb = (uint8_t)mode;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

