owhinata/stm32f746g-disco/port/camera/camera.c
	/* Completions observed this pass (one semaphore each): the wake plus any
	   drained extras.  We publish at most the most-recent buffer flip; every
	   other observed completion was overwritten -> ring overrun. */
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		extra++;
	seen = (had_sem ? 1u : 0u) + extra;

	ct = (DMA2_Stream1->CR & DMA_SxCR_CT) ? 1u : 0u;
	if (ct != cam_last_ct) {
		cam_last_ct = ct;
		/* CT==1 -> M0 just completed; CT==0 -> M1 just completed (the HAL
		   HAL_DMA_IRQHandler DBM dispatch mirrors this). */
		done = ct ? cam_m0 : cam_m1;
		freed = frame_pipeline_acquire(&cam_pipe);
		if (freed != NULL) {
			if (ct) {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY0);
				cam_m0 = freed;
			} else {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY1);
				cam_m1 = freed;
			}
			frame_pipeline_publish(&cam_pipe, done, CAMERA_FRAME_BYTES,
			                       FRAME_FMT_RGB565, CAMERA_FRAME_WIDTH,
			                       CAMERA_FRAME_HEIGHT,
			                       CAMERA_FRAME_WIDTH * 2u);
			published = 1;
		}
		/* freed == NULL: no free slot, drop (do not publish); the M-reg keeps
		   pointing at `done`, so the DMA simply refills it next cycle. */
	}
	if (seen > (uint32_t)published)
		cam_ring_ovr += seen - (uint32_t)published;
}

/* Dedicated producer (priority 10).  When no stream is running it sleeps
   indefinitely (0 CPU) on the start semaphore; while active it bounded-waits on
   the completion semaphore so --secs / stop / OVR fire even if frames stop
   arriving.  The two signals are SEPARATE semaphores on purpose: the start
   wakeup must never be consumed by the active bounded wait (it would be
   miscounted as a frame completion -> a spurious ring overrun). */
static void cam_producer_entry(ULONG arg)
{
	(void)arg;
	for (;;) {
		if (!cam_stream_active) {
			(void)tx_semaphore_get(&cam_start_sem, TX_WAIT_FOREVER);
			continue;
		}
		UINT got = tx_semaphore_get(&cam_stream_sem, CAM_PRODUCER_TICK);

		cam_stream_service(got == TX_SUCCESS);
	}
}

/* Start streaming with the ring/pipeline built fresh, attaching the counting
   sink plus an optional external sink @p ext (GUIX live preview, #56).  cam_lock
   MUST be held; returns 0 or CAM_ERR_* and NEVER unlocks (the public wrappers
   own the lock).  On success ownership of @p ext is recorded in cam_ext_sink
   (NULL for a plain `camera stream`). */
static int stream_start_locked(int colorbar, uint32_t frames, uint32_t secs,
                               struct frame_sink *ext)
{
	int rc;

	if (cam_stream_active)
		return CAM_ERR_STATE;          /* already streaming */
	if (!sdram_is_up())
		return CAM_ERR_STATE;
	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}
	rc = camera_configure_locked(colorbar != 0);
	if (rc != 0)
		return rc;

	/* Build the ring + pipeline fresh and attach the counting sink (+ ext). */
	if (frame_pipeline_init(&cam_pipe, &cam_pipe_os, cam_ring,
	                        CAMERA_FRAME_BYTES, CAM_RING_N) != 0)
		return CAM_ERR_STATE;
	frame_pipeline_set_format(&cam_pipe, FRAME_FMT_RGB565,
	                          CAMERA_FRAME_WIDTH, CAMERA_FRAME_HEIGHT);
	if (frame_pipeline_attach(&cam_pipe, &cam_stat_sink) != 0)
		return CAM_ERR_STATE;
	if (ext != NULL && frame_pipeline_attach(&cam_pipe, ext) != 0) {
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		return CAM_ERR_STATE;
	}
	cam_m0 = frame_pipeline_acquire(&cam_pipe);
	cam_m1 = frame_pipeline_acquire(&cam_pipe);
	if (cam_m0 == NULL || cam_m1 == NULL) {
		if (ext != NULL)
			frame_pipeline_detach(&cam_pipe, ext);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		return CAM_ERR_STATE;
	}

	cam_stream_ovr    = 0;
	cam_ring_ovr      = 0;
	cam_stream_fe     = 0;
	cam_stream_err    = 0;
	cam_stop_req      = 0;
	cam_last_ct       = 0;
	cam_elapsed_ms    = 0;
	cam_start_tick    = HAL_GetTick();
	cam_target_frames = frames;
	cam_target_secs   = secs;
	drain_stream_sem();

	/* Manual DBM start (the HAL's own >64KB path is intra-frame banding, not
	   inter-frame double buffering).  Order: callbacks -> DMA DBM start ->
	   DCMI CM=0 (continuous, before enable) -> enable -> ERR/OVR IT -> CAPTURE. */
	hdma_dcmi.XferCpltCallback   = cam_stream_dma_cb;
	hdma_dcmi.XferM1CpltCallback = cam_stream_dma_cb;
	hdma_dcmi.XferErrorCallback  = cam_stream_dma_err_cb;
	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);

	cam_stream_active = 1;             /* arm the ISR + producer */
	if (HAL_DMAEx_MultiBufferStart_IT(&hdma_dcmi,
	        (uint32_t)&hdcmi.Instance->DR,
	        (uint32_t)cam_m0->data, (uint32_t)cam_m1->data,
	        CAMERA_FRAME_BYTES / 4u) != HAL_OK) {
		cam_stream_active = 0;
		if (ext != NULL)
			frame_pipeline_detach(&cam_pipe, ext);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		LOG_ERR("stream DMA start failed");
		return CAM_ERR_HAL;
	}
	hdcmi.Instance->CR &= ~DCMI_CR_CM;            /* continuous */
	__HAL_DCMI_ENABLE(&hdcmi);
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR);
	hdcmi.Instance->CR |= DCMI_CR_CAPTURE;
	hdcmi.State = HAL_DCMI_STATE_BUSY;

	cam_ext_sink = ext;               /* record preview ownership (NULL = plain) */

	/* Wake the producer out of its idle FOREVER wait on the dedicated start
	   semaphore -- never the completion semaphore, so it cannot be miscounted. */
	(void)tx_semaphore_put(&cam_start_sem);
	LOG_INF("stream start (frames=%lu secs=%lu%s)",
	        (unsigned long)frames, (unsigned long)secs,
	        ext ? ", gui preview" : "");
	return 0;
}

int camera_stream_start(int colorbar, uint32_t frames, uint32_t secs)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	if (cam_ext_sink != NULL) {        /* owned by the GUIX live preview (#56) */
		op_unlock();
		return CAM_ERR_STATE;
	}
	rc = stream_start_locked(colorbar, frames, secs, NULL);
	op_unlock();
	return rc;
}

int camera_preview_start(struct frame_sink *s)
{
	int rc;

	if (s == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	rc = stream_start_locked(0, 0, 0, s);
	op_unlock();
	return rc;
}

